app/Controllers/TaskController.php

SELECT *
FROM `tasks`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tasks`
---
    public function index()
    {
        return view('tasks/index', [
            'tasks' => $this->taskModel->paginate(10),
            'pager' => $this->taskModel->pager, ]);

DELETE FROM `tasks`
WHERE `id` IN ('1')
---
    public function delete($id)
    {
        if ($this->taskModel->delete($id)) {

INSERT INTO `tasks` (`title`, `description`, `status`, `created_at`, `updated_at`) VALUES ('adasd', 'adadsd', 'pendente', '2025-07-15 23:04:23', '2025-07-15 23:04:23')
---
    public function store()
    {
        $rules = [
            'title' => 'required|min_length[3]',
            'description' => 'required|min_length[5]',
            'status' => 'required|in_list[pendente,em andamento,concluída]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                             ->withInput()
                             ->with('errors', $this->validator->getErrors());
        }

        $data = [
            'title' => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'status' => $this->request->getPost('status'),
            'created_at' => date('Y-m-d H:i:s'),
        ];
        if ($this->taskModel->insert($data)) {

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '1'
---
    public function edit($id)
    {
        return view('tasks/edit', [
            'task' => $this->taskModel->find($id),
        ]);

UPDATE `tasks` SET `title` = 'Falafel ', `description` = 'eu gosto de falfalfes', `status` = 'concluída', `updated_at` = '2025-07-15 22:59:51'
WHERE `tasks`.`id` IN ('1')
---
    public function update()
    {
        $data = [
            'title' => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'status' => $this->request->getPost('status'),
        ];

        $id = $this->request->getPost('id');

        $rules = [
            'title' => 'required|min_length[3]',
            'description' => 'required|min_length[5]',
            'status' => 'required|in_list[pendente,em andamento,concluída]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                             ->withInput()
                             ->with('errors', $this->validator->getErrors());
        }

        if ($this->taskModel->update($id, $data)) {

SELECT *
FROM `tasks`
---
    public function APIlist()
    {
        $data = $this->taskModel->findAll();